Revit 2021.1 API
ImageType.Create Method
Overload List
Name | Description
Create(Document, ImageTypeOptions)
 Creates a new ImageType element and loads the image into it.
Create(Document, String) |  Obsolete.
 Creates a new ImageType element and loads the image into it.
See Also
ImageType Class
ImageType Members
Autodesk.Revit.DB Namespace